app/Controllers/Dosen.php

    public function list()
    {
        $data = [
            'data'  => $this->dosen->paginate('20', 'dosen'),
            'title' => 'List Dosen',
            'pager' => $this->dosen->pager,
        ];
---
SELECT *
FROM `dosen`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `dosen`

    public function simpan()
    {
        $data = $this->request->getPost();

        if (! $this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->dosen->save($data);
---
INSERT INTO `dosen` (`nama_dosen`, `matkul_dosen`, `alamat_dosen`) VALUES ('Fauzan', 'pemograman', 'puri permai')